{
  "text": "<p><strong>Legal information</strong></p><p><strong>Privacy Notice: Get into Teaching Information Service</strong></p><p><strong>Who we are</strong></p><p>Department for Education </p><p>Mentions of “us” and “we” mean DfE and “you” means anyone using this service.</p><p>This work is being carried out by the Department for Education (DfE). For the purpose of data protection legislation, the DfE is the data controller for the personal data processed as part of the Get Into Teaching Information Service, including the Get School Experience service. </p><p>To access our teacher training adviser service, you need to be over 18 years old, and over 16 years old to access our mailing and teaching events service.</p><p><strong>Why we need your personal data</strong></p><p>We’ve created a service that lets you;</p><ul><li><p> get an adviser </p></li><li><p> signup for teaching events</p></li><li><p>sign up for updates</p></li></ul> <p>When you provide us with your personal data, we process it and provide you with tailored advice and information about; teacher training, teaching as a career and teaching events. These services will help you to make an informed decision about becoming a teacher or returning to teaching.</p><p><strong>Get an adviser</strong></p><p><strong>Personal data we collect </strong></p><p>When you sign up to get an adviser we collect personal data such as your;</p><ul><li><p>first name</p></li><li><p>last name</p></li><li><p>email address</p></li><li><p>address</p></li><li><p>postcode</p></li><li><p>contact telephone number</p></li><li><p>date of birth</p></li><li><p>IP address</p></li></ul> <p>We will also collect non-personal information such as your:</p><ul><li><p>previous teacher reference number, if you are returning to teaching</p></li></ul> <ul><li><p>previous teaching subject, if you are returning to teaching </p></li><li><p>preferred teaching stage</p></li><li><p>preferred teaching subjects</p></li><li><p>qualifications</p></li><li><p>degree subject</p></li><li><p>degree stage</p></li><li><p>degree class</p></li><li><p>intended training commencement year</p></li><li><p>country of residence</p></li><li><p>preferred call back date</p></li><li><p>preferred call back time</p></li><li><p>privacy policy consent</p></li></ul> <p><strong>What we do with your personal data when you sign up for a teacher training adviser</strong></p><p>The information you provide in the get an adviser form will be shared with our teacher training advisers, who will communicate with you by email and SMS to provide you with the support that you need. </p><p>If you have an equivalent qualification from another country and you live in the UK or outside the UK, your details will be shared with our Get Into Teaching helpline who will contact you to ensure they have accurate data about your circumstances in order to provide a tailored service and information to you. Any subsequent information you provide to the Get Into Teaching helpline will also be recorded to continue to provide you with the support that you need.</p><p><strong>Sign up for teaching events</strong></p><p><strong>Personal data we collect </strong></p><p>When you sign up for teaching events, we would collect personal data such as your;</p><ul><li><p>first name</p></li><li><p>last name</p></li><li><p>email address</p></li><li><p>telephone number (optional)</p></li><li><p>IP Address</p></li></ul> <p>We will also collect non-personal information such as your:</p><ul><li><p>privacy policy consent</p></li></ul> <p><strong>What we do with your personal data when you sign up for teaching events</strong></p><p>When you sign up for teaching events, the information you give to us will be used to provide tailored information about teaching events. We will send reminders and updates by email to the address you give us about the event you have signed up for.</p><p>If you provide us with your phone/ mobile number, we will only contact you by SMS with reminders and updates to events you have signed up for. </p><p><strong>Sign up for updates</strong></p><p><strong>Personal data we collect </strong></p><p>When you sign up for updates, we will collect personal data such as your;</p><ul><li><p>first name</p></li><li><p>last name</p></li><li><p>email address</p></li><li><p>postcode</p></li><li><p>telephone number (optional)</p></li><li><p>IP Address</p></li></ul> <p>We will also collect non-personal information such as your:</p><ul><li><p>degree stage</p></li><li><p>teaching subject</p></li><li><p>level of consideration in teaching </p></li><li><p>privacy policy consent</p></li></ul> <p><strong>What we do with your personal data when you sign up for updates</strong></p><p>When you sign up for mailing updates, the information you provide in the form will allow us to send you personalised emails containing tailored information about a career in teaching and teaching events in your postcode area. Any additional information you provide when you sign up for updates will help us to provide you with a tailored service.</p><p><strong>How we use your personal data when you sign up for our services</strong></p><ul><li><p>The additional information you provide when you communicate with the helpline and/or teacher training advisers will help us to aid you in progressing your application and continue to improve our service.</p></li><li><p>We may also contact you to gauge your interest in taking part in market research. In each message, you will be given the opportunity to unsubscribe from further communications.</p></li><li><p>The information we collect from you (such as your name, contact details and subject preferences) is used for identification, administration, analysis and targeting purposes. This allows us to ensure that public funds are being spent effectively.</p></li><li><p>We will use anonymised data about you to deliver tailored messages on third party platforms, including social media - like Pinterest, Facebook, Instagram, Twitter, Snapchat and Google search. Such anonymised data will also be used to identify and advertise to people that are similar to you, who may also be interested in our service.</p></li><li><p>If you are using the Get School Experience service, your data will be used to process your request for school experience with the school(s) in question. We will also use it to send out notifications, reminders and feedback questionnaires. We track your progress through this service to improve it for you and future applicants and to ensure public funds are being spent effectively.</p></li></ul> <p>Your personal data, supplied for the purposes of this service, will be stored in our customer relationship management system for 5 years.</p><p>If you do not supply us with your personal information then we cannot provide a tailored advice and information service or offer you access to the services available via our website such as booking a Train to Teach event. </p><p>However, without signing up for a teacher training adviser, signing up for an event or signing up for updates, you can still access general information via the Get Into Teaching helpline and website, and can complete an application for Initial Teacher Training through UCAS Teacher Training.</p><p><strong>Why our use of your personal data is lawful</strong></p><p>In order for our use of your personal data to be lawful, we need to meet one (or more) conditions in the data protection legislation. You have requested to receive this service and therefore, together with this privacy notice (about the use of your personal data), you have agreed to your data being used to deliver the service. However, the condition that we are relying on (once you have agreed to receiving the service) is that under Article 6 (1)(e) of the General Data Protection Regulations (GDPR) DfE is processing your personal data in the performance of a task carried out in the public interest.</p><p><strong>Who we will make your personal data available to</strong></p><p>We share your information with trusted partners working to deliver the service under a legal contract on our behalf in order for us to continue to provide you with relevant information about a career in teaching and teacher training or 'the service'. These partners are required to strictly comply with our privacy policies that prohibit them using your personal data for any other purpose.</p><p>We share certain personal data with UCAS Teacher Training, who manage the application system for teacher training. Sharing personal information with UCAS Teacher Training enables us to identify those who have applied for teacher training, and remove the names of these applicants from our communication list. </p><p>We also share data to track your application in order to determine the effectiveness of our service, monitor overall levels of teacher training applicants and improve it for you and future applicants.</p><p>If you are using the Get School Experience service, we will share some of your personal data to the staff who manage school experience at the school where you've requested school experience. This allows them to process your application and get back to you about your school experience.</p><p><strong>How long we will keep your personal data</strong></p><p>Your personal data, supplied for the purposes of this service, will be stored in our customer relationship management system for 5 years. We will delete this information if you request us to do so.</p><p><strong>Your data protection rights</strong></p><p>You have the right:</p><ul><li><p>to ask us for access to information about you that we hold</p></li><li><p>to have your personal data rectified if it is inaccurate or incomplete</p></li><li><p>to request the deletion or removal of personal data where there is no compelling reason for its continued processing</p></li><li><p>to restrict our processing of your personal data (i.e. permitting its storage but no further processing)</p></li><li><p>to object to direct marketing (including profiling) and processing for the purposes of scientific/historical research and statistics.</p></li></ul> <p>Please contact us at<strong> </strong><a href=\"mailto:getintoteaching.helpdesk@education.gov.uk\">getintoteaching.helpdesk@education.gov.uk</a><strong> </strong>and enter Data Protection as a reference regarding any of the rights listed above. </p><p>For the Data Protection Officer (DPO) please contact us via <a href=\"https://www.gov.uk/government/organisations/department-for-education/about/personal-information-charter\">gov.uk</a> and mark it for the attention of the ‘DPO’.</p><p>If you need to contact us regarding any of the above rights, please do so via the 'Talk to Us' section of the <a href=\"https://beta-getintoteaching.education.gov.uk/\">Get into Teaching</a> site.</p><p>Further information about your data protection rights appears on the <a href=\"https://ico.org.uk/your-data-matters/\">Information Commissioner's website</a>.</p><p><strong>Right to lodge a complaint</strong></p><p>If you are unhappy with our use of your personal data, please let us know by contacting <a href=\"mailto:getintoteaching.helpdesk@education.gov.uk\">getintoteaching.helpdesk@education.gov.uk</a>.</p><p>Alternatively, you have the right to raise any concerns with the <a href=\"https://ico.org.uk/concerns\">Information Commissioner's Office (ICO) via their website</a>.</p><p><strong>Last updated</strong></p><p>We may need to update this privacy notice periodically, so we recommend that you revisit this information from time to time. This version was last updated on 30/09/2020.</p><p>We use cookies to make our services easy, useful and reliable. Find out more on how we use <a href=\"https://getintoteaching.education.gov.uk/how-we-use-your-information\">cookies</a>.</p>",
  "createdAt": "2020-09-09T09:55:01",
  "id": "8da7ae80-82f2-ea11-a815-000d3a44afcc"
}
